{
  "full_transcript": "This call is being recorded. Hi, Mary's on first here. How can I help you? Hi, this is John with Soft Skillet. How are you doing today? Not bad. What can I do for you? Yeah, I was hoping to speak with Mary, your guys owner. Yeah, Mary's out but I manage the place and my name is Mark. What can I do for you? Awesome. Good to meet you Mark. I am with Soft Skillet and we provide reservation management software. How are things going for you guys today? On that front we're doing all right. We shuffle tables around pretty often which is a bit of a hassle. The system we use today doesn't like it when we have large parties and put a bunch of tables together. It basically creates a default which is annoying to do and then undo. How do you guys handle it? Oh yeah, I totally know where you're coming from. I actually ran a place for a few years and it always seemed like a hassle. With the typical kind of companies it feels like they don't actually know what they're doing with the software. But we make it easy to manage. You can have as many configurations as you want and toggle between them and you can add any that you want to. We're basically all ex restaurateurs around here at Soft Skillet and we know what it's actually like to run a place. It never feels like the other companies really do. That's pretty cool. We just moved over to this new system a month ago. We're still getting used to it right now but it doesn't seem all that bad. We're probably going to keep giving it a shot for a bit but I appreciate you calling. Yeah, no worries. Sounds good. And good luck with the new system. One other unrelated one for you. You guys take walk ins. I might actually swing by tonight. Yep, happy to have you. I can put a reservation in if you want. Yeah, I am all good for right now. I'm not sure if I'm actually going to be coming in tonight or tomorrow but I have wanted to try you guys out for a while. Drive by all the time. Usually pretty easy to get a table. Yep, Saturday afternoons are pretty much the only time you need a reservation to avoid a wait. Yeah, awesome. Perfect. And then just out of curiosity too, like any other problems you guys are running into. It sounds like filling the place is one if I'm able to walk in. But I'm always curious kind of what the new challenges are. I've been out of the business for a bit. Just getting back into Soft Skill. Wonder what's going on in the restaurant world. Yeah, Giving people in is the top priority here. I'm sure you ran into that one. You wouldn't imagine how much things have changed since the pandemic. Our order mix has shifted so much takeout. We used to roughly have 95% of orders come from people in the restaurant. Now there's always delivery drivers waiting near the entrance. It's really tough for the kitchen because they don't really know how to sequence their orders. The worst is when we get a bunch of online orders or a big online order comes in while we're seating people. Then the people in the restaurant are waiting, but the tickets come in after. The online tickets for our staff turns things into chaos and creates a longer wait time for parties that we sit right after online orders. I know our servers take some heat for it. We're actually getting a handful of people in right now, so I have to run, but hope you have a good one and come by soon. Happy to meet you in person. Cheers. Awesome. Thanks for the time. Sounds like a hassle, but we'll catch up. Have a good one. See ya. Bye.",
  "speaker_assignments": [
    {
      "speaker": "A",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "name": "Company"
    }
  ],
  "speakers": [
    {
      "speaker": "A",
      "text": "Hi, Mary's on first here. How can I help you?",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Hi, this is John with Soft Skillet. How are you doing today?",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "Not bad. What can I do for you?",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Yeah, I was hoping to speak with Mary, your guys owner.",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "Yeah, Mary's out but I manage the place and my name is Mark. What can I do for you?",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Awesome. Good to meet you Mark. I am with Soft Skillet and we provide reservation management software. How are things going for you guys today?",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "On that front we're doing all right. We shuffle tables around pretty often which is a bit of a hassle. The system we use today doesn't like it when we have large parties and put a bunch of tables together. It basically creates a default which is annoying to do and then undo. How do you guys handle it?",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Oh yeah, I totally know where you're coming from. I actually ran a place for a few years and it always seemed like a hassle. With the typical kind of companies it feels like they don't actually know what they're doing with the software. But we make it easy to manage. You can have as many configurations as you want and toggle between them and you can add any that you want to. We're basically all ex restaurateurs around here at Soft Skillet and we know what it's actually like to run a place. It never feels like the other companies really do.",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "That's pretty cool. We just moved over to this new system a month ago. We're still getting used to it right now but it doesn't seem all that bad. We're probably going to keep giving it a shot for a bit but I appreciate you calling.",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Yeah, no worries. Sounds good. And good luck with the new system. One other unrelated one for you. You guys take walk ins. I might actually swing by tonight.",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "Yep, happy to have you. I can put a reservation in if you want.",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Yeah, I am all good for right now. I'm not sure if I'm actually going to be coming in tonight or tomorrow but I have wanted to try you guys out for a while. Drive by all the time. Usually pretty easy to get a table.",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "Yep, Saturday afternoons are pretty much the only time you need a reservation to avoid a wait.",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Yeah, awesome. Perfect. And then just out of curiosity too, like any other problems you guys are running into. It sounds like filling the place is one if I'm able to walk in. But I'm always curious kind of what the new challenges are. I've been out of the business for a bit. Just getting back into Soft Skill. Wonder what's going on in the restaurant world.",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "Yeah, Giving people in is the top priority here. I'm sure you ran into that one. You wouldn't imagine how much things have changed since the pandemic. Our order mix has shifted so much takeout. We used to roughly have 95% of orders come from people in the restaurant. Now there's always delivery drivers waiting near the entrance. It's really tough for the kitchen because they don't really know how to sequence their orders. The worst is when we get a bunch of online orders or a big online order comes in while we're seating people. Then the people in the restaurant are waiting, but the tickets come in after. The online tickets for our staff turns things into chaos and creates a longer wait time for parties that we sit right after online orders. I know our servers take some heat for it. We're actually getting a handful of people in right now, so I have to run, but hope you have a good one and come by soon. Happy to meet you in person. Cheers.",
      "name": "Customer"
    },
    {
      "speaker": "B",
      "text": "Awesome. Thanks for the time. Sounds like a hassle, but we'll catch up. Have a good one. See ya.",
      "name": "Company"
    },
    {
      "speaker": "A",
      "text": "Bye.",
      "name": "Customer"
    }
  ],
  "audio_file": "Gcvvc45.mp3",
  "transcribed_at": "2024-11-11 15:33:10"
}